Revit 2024 API
ParameterTypeId.ViewSolarstudyLightingAltitudeText Property
 "Lighting altitude text"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ForgeTypeId ViewSolarstudyLightingAltitudeText { get; }
Visual Basic
Public Shared ReadOnly Property ViewSolarstudyLightingAltitudeText As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ ViewSolarstudyLightingAltitudeText {
	ForgeTypeId^ get ();
}
See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace